&НаКлиенте
Асинх Процедура Поздравить(Команда)
	
	ШрифтПоздравления = Новый Шрифт("Tahoma", 16, Истина);
	ЦветПоздравления = Новый Цвет(220, 20, 60);
	
	НовыйГод = Формат(Год(ТекущаяДата())+1, "ЧГ=0");
	Строки = Новый Массив;
	ЗаголовокТекста = НСтр("ru = 'С Новым годом!'; en = 'Happy New Year!'");
	ЗаголовокТекста = Новый ФорматированнаяСтрока(ЗаголовокТекста + Символы.ПС, ШрифтПоздравления, ЦветПоздравления);
	Строки.Добавить(ЗаголовокТекста);
	
	Поздравление = НСтр("ru = 'Желаю всего наилучшего в %1 году!'; en = 'Wishing you all the best in %1!'");
	Поздравление = СтрШаблон(Поздравление, НовыйГод);
	Поздравление = Новый ФорматированнаяСтрока(Поздравление, ШрифтПоздравления, ЦветПоздравления);
	
	Строки.Добавить(Поздравление);
	ТекстПоздравления = Новый ФорматированнаяСтрока(Строки);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Праздновать", НСтр("ru = 'Ура! На вечеринку!'; en = 'Woohoo! Let''s party!'"));
	Кнопки.Добавить("Работать", НСтр("ru = 'Работать'; en = 'Work'"));
	
	ЗаголовокОкна = СтрШаблон(НСтр("ru = 'Выбор пути на %1 год'; en = 'Path Choice for %1'"), НовыйГод);
	
	Вопрос = ВопросАсинх(ТекстПоздравления, Кнопки,,, ЗаголовокОкна);
	Результат = Ждать Вопрос;
	
	Если Результат = "Праздновать" Тогда
		ЗавершитьРаботуСистемы(Ложь);
	ИначеЕсли Результат = "Работать" Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры
